In [68]:
# Import Libraries
import pandas as pd
import matplotlib.pyplot as mptl
import seaborn as sns

import dtale

In [41]:
# Read the employees data
df = pd.read_excel("employees_data_12.09.2023.xlsx")
print(len(df))
df.info()

23078
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23078 entries, 0 to 23077
Data columns (total 25 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   SNo.                    23078 non-null  int64
 1   DDO Code                23078 non-null  object
 2   Department Name         23078 non-null  object
 3   Office Name             15837 non-null  object
 4   Group                   23078 non-null  object
 5   Kgid No                 23078 non-null  int64
 6   Name Of The Official    23078 non-null  object
 7   Parent Name             22950 non-null  object
 8   Designation             23078 non-null  object
 9   Gender                  23078 non-null  object
 10  Spouse Working          23078 non-null  object
 11  Scale Of Pay            23078 non-null  object
 12  Join Date               23078 non-null  datetime64[ns]
 13  Length Of Service       23078 non-null  int64
 14  Date Of Birth           23078 non-null  datetime64[ns]
 15  Age                     23078 non-null  int64
 16  Present Basic           23078 non-null  int64
 17  Physically Handicapped  266 non-null    object
 18  Residence Addresss      23078 non-null  object
 19  Pin Code                23078 non-null  int64
 20  Phone Number            1277 non-null   float64
 21  Mobile Number           11301 non-null  object
 22  PRAN Number             11190 non-null  float64
 23  Home Town               617 non-null    object
 24  Taluk Name              23078 non-null  object
dtypes: datetime64[ns](2), float64(2), int64(6), object(15)
memory usage: 4.4+ MB

In [43]:
print(df.head(5))

   SNo.    DDO Code             Department Name  \
0     1  0100CU0003  City Municipal Corporation
1     2  0100CU0003  City Municipal Corporation
2     3  0100CU0003  City Municipal Corporation
3     4  0100CU0003  City Municipal Corporation
4     5  0100CU0003  City Municipal Corporation

                                Office Name Group    Kgid No  \
0  City Municipal Council Madanayakanahalli     A  911008298
1  City Municipal Council Madanayakanahalli     B  911009675
2  City Municipal Council Madanayakanahalli     B  911004295
3  City Municipal Council Madanayakanahalli     B  911007485
4  City Municipal Council Madanayakanahalli     C  911031548

  Name Of The Official          Parent Name                   Designation  \
0           SOWMYA B R  Raghavenrda rao B V  Assistant Executive Engineer
1       ANIL KUMAR G S           Shivanna N       Accounts Superintendent
2  HANUMANTHEGOWDA H C     Late Chikkanna H                  Commissioner
3           KARUNA C P    Parthasarathy C R     Community Affairs Officer
4       BASAVARAJU S R     RANGABASAVEGOWDA                         F.D.A

   Gender  ... Age Present Basic Physically Handicapped  \
0  FEMALE  ...  45         67550                    NaN
1    MALE  ...  35         44200                    NaN
2    MALE  ...  60         59700                    NaN
3  FEMALE  ...  55         53900                    NaN
4    MALE  ...  37         28950                    NaN

                                  Residence Addresss Pin Code  Phone Number  \
0                          Bramhanara beedi-Pavagada   561202           NaN
1  #111,Gottigehalli village,harohalli hobli-Kana...   562112           NaN
2                C/O P Rajanna,Ashok Nagar-Vijaypura   562135           NaN
3  #655. Giripadma, 7th B Cross-16th Main, MEI La...   560073           NaN
4  SINGASANDRA VILLAGE, KOTTAGALU POST-HAROHALLI ...   562117           NaN

   Mobile Number   PRAN Number  Home Town         Taluk Name
0            NaN           NaN        NaN  BANGALORE (URBAN)
1     9663679306  1.101530e+11  Ramanagar  BANGALORE (URBAN)
2     9845412696           NaN        NaN  BANGALORE (URBAN)
3     9449726270           NaN        NaN  BANGALORE (URBAN)
4     9741816796  1.101867e+11        NaN  BANGALORE (URBAN)

[5 rows x 25 columns]

In [44]:
df.keys()

Index(['SNo.', 'DDO Code', 'Department Name', 'Office Name', 'Group',
       'Kgid No', 'Name Of The Official', 'Parent Name', 'Designation',
       'Gender', 'Spouse Working', 'Scale Of Pay', 'Join Date',
       'Length Of Service', 'Date Of Birth', 'Age', 'Present Basic',
       'Physically Handicapped', 'Residence Addresss', 'Pin Code',
       'Phone Number', 'Mobile Number', 'PRAN Number', 'Home Town',
       'Taluk Name'],
      dtype='object')

In [45]:
df = df.drop(['SNo.','Department Name', 'Office Name', 'Parent Name','Spouse Working','Length Of Service','Age',
              'Residence Addresss','Pin Code', 'Phone Number', 'Mobile Number', 'Home Town', 'Taluk Name'],axis=1)
df.keys()

Index(['DDO Code', 'Group', 'Kgid No', 'Name Of The Official', 'Designation',
       'Gender', 'Scale Of Pay', 'Join Date', 'Date Of Birth', 'Present Basic',
       'Physically Handicapped', 'PRAN Number'],
      dtype='object')

In [46]:
df = df.rename(columns={"PRAN Number":"PRAN","PRAN No.":"PRAN", "Kgid No":"Emp_ID","DDO Code":"DDO_Code",
                       "Name Of The Official":"Emp_Name","Scale Of Pay":"Pay_Scale","Join Date":"DOJ",
                       "Date Of Birth":"DOB", "Present Basic":"Basic_Pay","Physically Handicapped":"Phy_H"})

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23078 entries, 0 to 23077
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   DDO_Code     23078 non-null  object
 1   Group        23078 non-null  object
 2   Emp_ID       23078 non-null  int64
 3   Emp_Name     23078 non-null  object
 4   Designation  23078 non-null  object
 5   Gender       23078 non-null  object
 6   Pay_Scale    23078 non-null  object
 7   DOJ          23078 non-null  datetime64[ns]
 8   DOB          23078 non-null  datetime64[ns]
 9   Basic_Pay    23078 non-null  int64
 10  Phy_H        266 non-null    object
 11  PRAN         11190 non-null  float64
dtypes: datetime64[ns](2), float64(1), int64(2), object(7)
memory usage: 2.1+ MB

In [48]:
# Read the ULB_Registration file to a variable to map the ULB name with the DDO Code of employee list
reg_data = pd.read_excel("NPS_DTO_DDO_Information.xlsx")

# Drop the unnecessary columns in Registration Details file and keep required columns
reg_data_new = reg_data[['DDO Code (HRMS)','ULB Name','Type','Dist.','Div.']]

# Renaming the DDO Code columns to match with employee List file
reg_data_new = reg_data_new.rename(columns={"DDO Code (HRMS)":"DDO_Code","Dist.":"District",
                                            "Div.":"Division","ULB Name":"ULB_Name"})

# Mapping ULB Name to DDO Code of Employee List like 'VLOOKUP'
df1 = pd.merge(df,reg_data_new,on='DDO_Code', how='left')

df1.keys()

Index(['DDO_Code', 'Group', 'Emp_ID', 'Emp_Name', 'Designation', 'Gender',
       'Pay_Scale', 'DOJ', 'DOB', 'Basic_Pay', 'Phy_H', 'PRAN', 'ULB_Name',
       'Type', 'District', 'Division'],
      dtype='object')

In [49]:
# Re-arranging the columns as per requirements
df1 = df1[['Division','District','DDO_Code','ULB_Name','Type','Emp_ID','Emp_Name','Designation',
           'Gender','Group','Phy_H','DOB','DOJ','Pay_Scale','Basic_Pay','PRAN']]
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 23078 entries, 0 to 23077
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Division     23078 non-null  object
 1   District     23078 non-null  object
 2   DDO_Code     23078 non-null  object
 3   ULB_Name     23078 non-null  object
 4   Type         23078 non-null  object
 5   Emp_ID       23078 non-null  int64
 6   Emp_Name     23078 non-null  object
 7   Designation  23078 non-null  object
 8   Gender       23078 non-null  object
 9   Group        23078 non-null  object
 10  Phy_H        266 non-null    object
 11  DOB          23078 non-null  datetime64[ns]
 12  DOJ          23078 non-null  datetime64[ns]
 13  Pay_Scale    23078 non-null  object
 14  Basic_Pay    23078 non-null  int64
 15  PRAN         11190 non-null  float64
dtypes: datetime64[ns](2), float64(1), int64(2), object(11)
memory usage: 3.0+ MB

## EDA of Employee data

In [50]:
df1['PRAN'] = df1['PRAN'].fillna(0)
df1['PRAN'] = df1['PRAN'].astype('int64')

In [51]:
print(df1['DOJ'][0])
df1['DOJ'][0] + pd.offsets.DateOffset(years=25)

2005-10-19 00:00:00

Timestamp('2030-10-19 00:00:00')

In [52]:
df1['Service_25y'] = df1['DOJ'][0] + pd.offsets.DateOffset(years=25)
df1.head(5)

,Division,District,DDO_Code,ULB_Name,Type,Emp_ID,Emp_Name,Designation,Gender,Group,Phy_H,DOB,DOJ,Pay_Scale,Basic_Pay,PRAN,Service_25y
0,Bengaluru,Bengaluru Urban,0100CU0003,Madanayakanahalli,CMC,911008298,SOWMYA B R,Assistant Executive Engineer,FEMALE,A,NaN,1978-10-22,2005-10-19,52650-97100,67550,0,2030-10-19
1,Bengaluru,Bengaluru Urban,0100CU0003,Madanayakanahalli,CMC,911009675,ANIL KUMAR G S,Accounts Superintendent,MALE,B,NaN,1988-06-15,2011-03-28,40900-78200,44200,110153025634,2030-10-19
2,Bengaluru,Bengaluru Urban,0100CU0003,Madanayakanahalli,CMC,911004295,HANUMANTHEGOWDA H C,Commissioner,MALE,B,NaN,1963-06-01,2005-10-28,40900-78200,59700,0,2030-10-19
3,Bengaluru,Bengaluru Urban,0100CU0003,Madanayakanahalli,CMC,911007485,KARUNA C P,Community Affairs Officer,FEMALE,B,NaN,1968-06-01,2005-10-28,40900-78200,53900,0,2030-10-19
4,Bengaluru,Bengaluru Urban,0100CU0003,Madanayakanahalli,CMC,911031548,BASAVARAJU S R,F.D.A,MALE,C,NaN,1986-07-23,2021-07-29,27650-52650,28950,110186732950,2030-10-19

In [53]:
# len(df2[df2['Service_25y'] < '2023-09-30'])
print(df1['DOB'][0])
print(df1['DOJ'][0])
print(df1['Service_25y'][0])

1978-10-22 00:00:00
2005-10-19 00:00:00
2030-10-19 00:00:00

In [54]:
df1.keys()

Index(['Division', 'District', 'DDO_Code', 'ULB_Name', 'Type', 'Emp_ID',
       'Emp_Name', 'Designation', 'Gender', 'Group', 'Phy_H', 'DOB', 'DOJ',
       'Pay_Scale', 'Basic_Pay', 'PRAN', 'Service_25y'],
      dtype='object')

In [55]:
# Droping the OPS employees and retaining the NPS Employees
print(len(df1))
print(len(df1[df1['DOJ'] < '2006-04-01']))
print(len(df1[df1['DOJ'] > '2006-03-31']))

23078
10871
12207

In [56]:
df1['Division'].value_counts()

Belagavi      6346
Bengaluru     5848
Mysuru        5758
Kalaburagi    5126
Name: Division, dtype: int64

In [57]:
df1['District'].value_counts()

Mysuru              2656
Belagavi            1675
Dharwad             1476
Tumakuru            1159
Davanagere          1124
Shivamogga          1048
Kalaburagi          1005
Raichur              938
Ballari              913
Bagalakote           844
Vijayapura           801
Dakshina Kannada     776
Hassan               708
Bidar                699
Vijayanagara         639
Uttara Kannada       565
Kolar                542
Yadagiri             533
Mandya               514
Gadag                497
Haveri               488
Chitradurga          476
Chikkamagaluru       438
Bengaluru Rural      426
Ramanagara           417
Chikkaballapura      403
Koppal               399
Udupi                261
Bengaluru Urban      253
Chamarajanagara      246
Kodagu               159
Name: District, dtype: int64

#### Pay_scale difference

In [58]:
pay_scale = ['17000-28950','18600-32600','19950-37900','21400-42000','23500-47650','25800-51400','27650-52650',
             '30350-58250','33450-62600','36000-67550','37900-70850','40900-78200','43100-83900','45300-88300',
             '48900-92700','52650-97100','56800-99600','61150-102100','67550-104600','70850-107100','74400-109600',
             '82000-117700','90500-123300','97100-141300','104600-150600']

df1['payscale_check'] = df1['Pay_Scale'].isin(pay_scale)

# data[data['subjects'].isin(list2)]

In [59]:
PayScale_nm = df1[df1['payscale_check'] == False]

print(len(PayScale_nm))
PayScale_nm.head()

1581

,Division,District,DDO_Code,ULB_Name,Type,Emp_ID,Emp_Name,Designation,Gender,Group,Phy_H,DOB,DOJ,Pay_Scale,Basic_Pay,PRAN,Service_25y,payscale_check
189,Bengaluru,Bengaluru Urban,0101TU0003,Bommasandra,TMC,911025105,SURENDRA C,Water Supply Assistant,MALE,D,NaN,1979-06-10,2015-06-24,9600-14550,10200,110121636348,2030-10-19,False
261,Bengaluru,Bengaluru Rural,0302TU0001,Devanahalli,TMC,911007779,DD THIPPAIAH,F.D.A,MALE,C,NaN,1953-12-02,1977-01-13,14550-26700,26000,0,2030-10-19,False
269,Bengaluru,Bengaluru Rural,0302TU0001,Devanahalli,TMC,911007740,RAMALINGEGOWDA,Revenue Officer,MALE,C,NaN,1952-05-04,1976-04-15,10000-18150,16400,0,2030-10-19,False
273,Bengaluru,Bengaluru Rural,0302TU0001,Devanahalli,TMC,911004750,VENKATARAJU G,Bill Collector,MALE,C,NaN,1952-04-15,1972-07-01,5800-10500,10500,0,2030-10-19,False
319,Bengaluru,Bengaluru Rural,0302TU0002,Vijaypura,TMC,911004397,M BYRAPPA,S.D.C,MALE,C,NaN,1955-05-06,1986-08-01,11600-21000,21000,0,2030-10-19,False

In [60]:
print(PayScale_nm['DOJ'].min())
print(PayScale_nm['DOJ'].max())

1970-06-22 00:00:00
2020-10-28 00:00:00

In [61]:
old_ps = PayScale_nm.groupby(['District','ULB_Name','Designation','Pay_Scale'])['Emp_ID'].count()
old_ps.head()

District    ULB_Name    Designation                   Pay_Scale
Bagalakote  Badami      Helper                        10400-16400    1
                        S.D.C                         14550-26700    1
            Bagalakote  Assistant Executive Engineer  24000-45300    1
                        Attender                      10400-16400    2
                        Dafedar                       10400-16400    2
Name: Emp_ID, dtype: int64

In [62]:
df1['payscale_check'].value_counts()

True     21497
False     1581
Name: payscale_check, dtype: int64

### Grouping data

In [63]:
# len(df1.groupby(by=['Type'])['Emp_ID'].sum())
list = df1.groupby('Type')['Emp_ID'].count()
list

Type
CC     7685
CMC    6897
NAC       5
TMC    6180
TP     2311
Name: Emp_ID, dtype: int64

In [64]:
cadre = df1.groupby(['Designation','Pay_Scale'])['Emp_ID'].count()
cadre

Designation         Pay_Scale
A.N.M. Mid Wife     16000-29600     1
                    23500-47650     1
                    25800-51400     1
                    30350-58250     1
                    33450-62600     3
                                   ..
Zonal Commissioner  40900-78200     4
                    43100-83900     3
                    52650-97100     4
                    56800-99600     2
                    74400-109600    1
Name: Emp_ID, Length: 852, dtype: int64

In [65]:
desgn = pd.DataFrame(df1['Designation'].value_counts())
desgn

                              Designation
Powra Karamika                       8463
P.K./U.K.G/P.K                       1797
S.D.C                                1546
Attender                              861
Pourakarmika                          742
...                                   ...
Vehicle Cleaner                         1
Electrical Superintendent               1
Data Entry Operator Grade-II            1
Joint Commissioner                      1
JUNIOR PROGRAMMER                       1

[213 rows x 1 columns]

### Writing data to excel files

In [66]:
# Define the function to write the datasets to excel file
def write_excl(data, data1):
    # print(len(data))
    with pd.ExcelWriter('view.xlsx', engine='xlsxwriter', datetime_format="DD-MM-YYYY") as writer:
        data.to_excel(writer,sheet_name='review')
        data1.to_excel(writer,sheet_name='review1')
        print("Write Done!")

In [67]:
# write_excl(desgn)
write_excl(cadre,desgn)

Write Done!